<?php
//$fruits[18] = "Яблоки";
//$fruits[33] = "Груши";
//$fruits[21] = "Апельсины";

//$fruits = array("Яблоки", "Груши", "Апельсины");
//$fruits = array(18=>"Яблоки",33=>"Груши",21=>"Апельсины");

/*$fruits["Яблоки"]["Белый налив"] = 11;
$fruits["Яблоки"]["Гренни"] = 8;
$fruits["Яблоки"]["Отечественные"] = 3;*/

$fruits["Яблоки"] = array("Белый налив"=>11,"Гренни"=>8,"Отечественные"=>3);
$fruits['Груши'] = 11;
$fruits['Апельсины'] = 23;
$fruits["Персики"] = array("сорт1"=>26,"сорт2"=>24,"сорт3"=>17);

foreach($fruits as $k=>$v)
{


    if(is_array($v))
    {
        foreach ($v as $k1=>$v1)
        {
            echo $k." - ";
            echo $k1." - ";
            echo $v1."кг.<br>";
        }
    }
    else
    {
        echo $k." - ";
        echo $v."кг.<br>";
    }
}

